# RbsIsCustomFitting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsIsCustomFitting Property
ParameterTypeId Class See Also
---
"IsCustom"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsIsCustomFitting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsIsCustomFitting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsIsCustomFitting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace